blogstrap/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "code", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dfsdfg"], ["code", nil], ["price", nil], ["created_at", "2023-02-01 20:27:38.898549"], ["updated_at", "2023-02-01 20:27:38.898549"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 67.0], ["updated_at", "2023-02-01 20:39:54.649746"], ["id", 3]]