TreinaWeb/MVC/app/controllers/produtos_controller.rb

  def index
      render plain: 'Texto reinderizado ' + Produto.all[0].name # renderiza isso
---
SELECT `produtos`.* FROM `produtos`